Repository: 0kakarot0/DropZone
Catalog: l10n/app_*.arb
Languages: ar

# appTitle
source: DropZone Chauffeur
ar: دروب زون شوفير

# navHome
source: Home
ar: الرئيسية

# navBookings
source: Bookings
ar: الحجوزات

# navSupport
source: Support
ar: الدعم

# navProfile
source: Profile
ar: الملف الشخصي

# homeHeroTitle
source: Private Chauffeur, pre‑booked.
ar: سائق خاص بالحجز المسبق.

# homeHeroSubtitle
source: Airport & business rides across the UAE
ar: خدمة المطار والأعمال داخل الإمارات

source: Book now
ar: احجز الآن

# bookingTitle
source: Book a ride
ar: احجز مشوار

source: Trip type
ar: نوع الرحلة

# tripAirportPickup
source: Airport pickup
ar: استقبال من المطار

# tripAirportDrop
source: Airport drop
ar: توصيل إلى المطار

# tripBusiness
source: Business ride
ar: رحلة أعمال

source: Pickup
ar: نقطة الانطلاق

source: Drop‑off
ar: نقطة الوصول

source: Date
ar: التاريخ

source: Time
ar: الوقت

source: Passengers
ar: الركاب

source: Luggage
ar: الأمتعة

source: Vehicle class
ar: فئة المركبة

# vehicleSedan
source: Sedan
ar: سيدان

# vehicleSUV
source: SUV
ar: دفع رباعي

# vehicleLuxury
source: Luxury
ar: فاخرة

# vehicleVan
source: Van
ar: فان

# continueLabel
source: Continue
ar: متابعة

source: Summary
ar: الملخص

source: Estimated price
ar: السعر التقديري

# pricePlaceholder
source: AED —
ar: — درهم

source: Confirm request
ar: تأكيد الطلب

# supportTitle
source: Support
ar: الدعم

# profileTitle
source: Profile
ar: الملف الشخصي

# bookingsTitle
source: My bookings
ar: حجوزاتي

# emptyBookings
source: No bookings yet
ar: لا توجد حجوزات

source: Coming soon
ar: قريباً

# authTitle
source: Sign in
ar: تسجيل الدخول

source: Send OTP
ar: إرسال رمز التحقق

source: Verify phone
ar: تأكيد الهاتف

# otpPrompt
source: Enter the 4-digit code sent to you
ar: أدخل الرمز المكون من 4 أرقام المرسل إليك

# verifyAndContinue
source: Verify & continue
ar: تأكيد والمتابعة

source: Profile details
ar: بيانات الملف الشخصي

source: Saved passengers
ar: الركاب المحفوظون

# passengerSelf
source: Self
ar: أنا

# passengerAssistant
source: Assistant
ar: المساعد

# passengerExecutive
source: Executive
ar: التنفيذي

source: Corporate mode
ar: وضع الشركات

# businessAccountToggle
source: Business account
ar: حساب أعمال

# corporateSubtitle
source: Enable to add company details
ar: فعّل لإضافة بيانات الشركة

source: Save profile
ar: حفظ الملف

source: Upcoming
ar: القادمة

source: Past
ar: السابقة

source: Booking details
ar: تفاصيل الحجز

source: Status timeline
ar: حالة الرحلة

# statusRequested
source: Requested
ar: تم الطلب

# statusConfirmed
source: Confirmed
ar: تم التأكيد

# statusDriverAssigned
source: Driver assigned
ar: تم تعيين السائق

# statusEnRoute
source: En route
ar: في الطريق

# statusCompleted
source: Completed
ar: مكتمل

# statusCancelled
source: Cancelled
ar: ملغي

# policyTitle
source: Cancellation policy
ar: سياسة الإلغاء

# policyBody
source: Free cancellation up to 2 hours before pickup. Fees may apply afterwards.
ar: إلغاء مجاني حتى ساعتين قبل الموعد. قد تُطبّق رسوم بعد ذلك.

source: Reschedule
ar: إعادة جدولة

source: Cancel booking
ar: إلغاء الحجز

# bookingCreated
source: Booking request submitted
ar: تم إرسال طلب الحجز

# surchargeNote
source: Airport fees and night surcharges may apply
ar: قد تُطبق رسوم المطار والرسوم الليلية

# errorLabel
source: Error
ar: خطأ

# rescheduleConfirmed
source: Reschedule request sent
ar: تم إرسال طلب إعادة الجدولة

# cancelConfirmed
source: Booking cancelled
ar: تم إلغاء الحجز

# paymentTitle
source: Payment
ar: الدفع

# chooseCard
source: Choose a card
ar: اختر بطاقة

# expires
source: Expires {expiry}
ar: ينتهي {expiry}

# amountDue
source: Amount due: AED {amount}
ar: المبلغ المستحق: {amount} درهم

source: Pay now
ar: ادفع الآن

# paymentSuccess
source: Payment successful: {id}
ar: تم الدفع بنجاح: {id}

# receiptTitle
source: Receipt
ar: الإيصال

# receiptId
source: Receipt ID: {id}
ar: رقم الإيصال: {id}

# tripTrackingTitle
source: Trip tracking
ar: تتبع الرحلة

# mapPlaceholder
source: Live map preview
ar: معاينة الخريطة

# driverAssignedTitle
source: Driver assigned
ar: تم تعيين السائق

# driverAssignedSubtitle
source: Ahmed • Lexus ES • DXB 1234
ar: أحمد • لكزس ES • DXB 1234

# etaLabel
source: ETA
ar: الوقت المتوقع

source: Contact driver
ar: تواصل مع السائق

# contactDriverHint
source: Calling masked number
ar: الاتصال برقم مخفي

# notificationsTitle
source: Notifications
ar: الإشعارات

# notificationConfirmed
source: Booking confirmed
ar: تم تأكيد الحجز

# notificationConfirmedBody
source: Your driver is being assigned
ar: جارٍ تعيين السائق

# notificationDriverAssigned
source: Driver assigned
ar: تم تعيين السائق

# notificationDriverAssignedBody
source: Ahmed will arrive soon
ar: أحمد سيصل قريباً

source: Submit issue
ar: إرسال المشكلة

# airportEnhancementsTitle
source: Airport enhancements
ar: خدمات المطار

# flightTrackingTitle
source: Flight tracking
ar: تتبع الرحلة

# flightStatusLabel
source: Flight status
ar: حالة الرحلة

# flightStatusValue
source: On time · Terminal 3
ar: في الوقت المحدد · المبنى 3

# meetGreetTitle
source: Meet & greet
ar: الاستقبال والترحيب

# meetGreetBody
source: Your driver will wait at arrivals with your name sign.
ar: سيكون السائق بانتظارك عند الوصول مع لوحة باسمك.

# saveFlightInfo
source: Save flight details
ar: حفظ تفاصيل الرحلة

# contactDriverTitle
source: Contact driver
ar: التواصل مع السائق

# maskedCallTitle
source: Masked call
ar: مكالمة مخفية

# maskedCallBody
source: Use a masked number for privacy
ar: استخدم رقمًا مخفيًا للخصوصية

# inAppChatTitle
source: In-app chat
ar: دردشة داخل التطبيق

# inAppChatBody
source: Secure messaging with driver
ar: مراسلة آمنة مع السائق

source: Start masked call
ar: بدء مكالمة مخفية

# maskedCallHint
source: Calling via masked number
ar: الاتصال عبر رقم مخفي

# notificationArriving
source: Driver arriving
ar: السائق في الطريق

# notificationArrivingBody
source: ETA 8 minutes
ar: الوقت المتوقع 8 دقائق

# helpCenterTitle
source: Help center
ar: مركز المساعدة

# helpTopicPayment
source: Payment issues
ar: مشاكل الدفع

# helpTopicDriver
source: Driver support
ar: الدعم مع السائق

# helpTopicLostItem
source: Lost items
ar: المفقودات

# reportIssueTitle
source: Report an issue
ar: الإبلاغ عن مشكلة

# issueCategoryPayment
source: Payment
ar: الدفع

# issueCategoryDriver
source: Driver
ar: السائق

# issueCategoryOther
source: Other
ar: أخرى

source: Select category
ar: اختر الفئة
